.planning/case_profiles/case_028_v4_apu_bay_ventilation_dicts/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

// case_028 v4 (V65-A B79) APU bay ventilation · pimpleFoam PIMPLE algorithm
// v4 change vs v3: SIMPLE → PIMPLE for transient relax-to-steady · pushes residual gate

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
        nSweeps         2;
    }

    "(U|k|omega)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors        3;       // 3 outer iter per timestep · pushes within-timestep convergence
    nCorrectors             2;       // 2 PISO inner correctors
    nNonOrthogonalCorrectors 1;
    pRefCell                0;
    pRefValue               0;
    consistent              yes;
    momentumPredictor       yes;
    turbOnFinalIterOnly     false;
    residualControl
    {
        U
        {
            relTol          0;
            tolerance       1e-4;
        }
        p
        {
            relTol          0;
            tolerance       1e-4;
        }
        "(k|omega)"
        {
            relTol          0;
            tolerance       1e-4;
        }
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
        pFinal          1.0;
    }
    equations
    {
        U               0.7;
        UFinal          1.0;
        k               0.7;
        kFinal          1.0;
        omega           0.7;
        omegaFinal      1.0;
    }
}

cache
{
    grad(U);
}
